dgarcoe/ham_radio_companion_sensecap_indicator/sdkconfig.defaults
# Target
CONFIG_IDF_TARGET="esp32s3"

# Flash & PSRAM (SenseCAP Indicator D1L: 8 MB flash, 8 MB Octal PSRAM)
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="8MB"
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

# Bluetooth: we don't use it. Disabling reclaims ~50 KB of internal RAM.
CONFIG_BT_ENABLED=n

# Task watchdog: the default config checks idle tasks, and we have
# legitimate cases (large LVGL refresh, blocking telnet recv) where
# idle starves briefly. The errors flood the log and make real panics
# unreadable. Disable it entirely - the interrupt watchdog still
# catches genuine deadlocks.
CONFIG_ESP_TASK_WDT_INIT=n
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU0=n
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU1=n

# Custom partition table (factory + 2 ota + nvs + storage)
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Main task: app_main builds every screen up front (LVGL object trees,
# style cascades, first refresh). 8 KB was overflowing.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=16384

# FreeRTOS tick
CONFIG_FREERTOS_HZ=1000

# LWIP
CONFIG_LWIP_LOCAL_HOSTNAME="hamcompanion"

# mbedTLS cert bundle (used by esp_http_client over HTTPS for the
# propagation fetcher and any future TLS endpoints).
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y

# mbedTLS memory: route every mbedtls allocation to PSRAM. The SSL
# context + handshake state + cert chain easily exceed what's free in
# internal RAM once WiFi/LWIP/LVGL are running, and mbedtls_ssl_setup()
# was failing with -0x7F00 (ALLOC_FAILED). PSRAM is fine here - no DMA
# is involved in TLS state.
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y

# Shrink TLS record buffers: the endpoints we hit (hamqsl XML, POTA JSON)
# fit in a few KB; the default 16 KB in + 16 KB out is wasteful.
CONFIG_MBEDTLS_ASYMMETRIC_CONTENT_LEN=y
CONFIG_MBEDTLS_SSL_IN_CONTENT_LEN=8192
CONFIG_MBEDTLS_SSL_OUT_CONTENT_LEN=4096

# Free the peer cert + config blob after the handshake completes.
CONFIG_MBEDTLS_DYNAMIC_BUFFER=y
CONFIG_MBEDTLS_DYNAMIC_FREE_PEER_CERT=y
CONFIG_MBEDTLS_DYNAMIC_FREE_CONFIG_DATA=y

# SenseCAP Indicator D1L panel selection (BSP)
CONFIG_LCD_BOARD_SENSECAP_INDICATOR_D1L=y
CONFIG_SENSECAP_INDICATOR_SCREEN_GX=y

# LVGL: route all internal allocations to PSRAM via main/lv_psram_alloc.c.
# Internal RAM is ~150 KB after WiFi/LWIP/FreeRTOS and a single screen of
# LVGL widgets can exhaust it. With CUSTOM_MALLOC, LVGL calls our
# wrappers around heap_caps_malloc(MALLOC_CAP_SPIRAM) for every alloc.
CONFIG_LV_USE_CUSTOM_MALLOC=y
CONFIG_LV_COLOR_DEPTH_16=y

# LVGL fonts used by the UI (watch + status bar + settings)
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_18=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_FONT_MONTSERRAT_48=y

# Skip LVGL's software anti-aliased mask path. We have no rounded
# corners / shadows by design - the complex-draw renderer would still
# walk it for borders + fills and either OOM on the mask alloc or
# spin in circ_calc_aa4 long enough to trip the task watchdog.
CONFIG_LV_DRAW_SW_COMPLEX=n

# Compiler
CONFIG_COMPILER_OPTIMIZATION_PERF=y
